Repository: wp-plugins/simple-download-monitor
Catalog: lang/*.po
Languages: cs_cz

source: Simple Download Monitor error
cs_cz: Simple Download Monitor: chyba

source: You have exceeded your download quota today. Please try again in %d hours and %d minutes.
cs_cz: Překročil jste svůj dnešní povolený počet downloadů. Zkuste to prosím znovu za %d hodin a %d minut.

source: Requested file <strong>%s</strong> not found.
cs_cz: Požadovaný soubor <strong>%s</strong> nebyl nalezen.

source: Requested file <strong>%s</strong> has an invalid path.
cs_cz: Požadovaný soubor <strong>%s</strong> má neplatný adresář.

source: Requested file <strong>%s</strong> has an invalid extension.
cs_cz: Požadovaný soubor <strong>%s</strong> má neplatnou příponu.

source: Simple Download Monitor options
cs_cz: Simple Download Monitor - nastavení

source: Access rights
cs_cz: Přístupová práva

source: You can set up user rights required to access various functions of Simple Download Monitor. Rights are assigned through capabilities (see <a href="http://codex.wordpress.org/Roles_and_Capabilities#Roles">Roles and Capabilities</a> in WordPress Codex). Predefined values are <strong>read</strong> ("any registered user") for displaying stats, <strong>delete_users</strong> ("administrator") for reseting stats and <strong>manage_options</strong> ("administrator") for changing options.
cs_cz: Zde můžete nastavit uživatelská práva potřebná pro přístup k jednotlivým funkcím Simple Download Monitoru. Práva jsou definována prostřednictvím schopností (capabilities, viz <a href="http://codex.wordpress.org/Roles_and_Capabilities#Roles">Roles and Capabilities</a> ve WordPress Codex). Výchozí hodnoty jsou <strong>read</strong> ("každý registrovaný uživatel) pro zobrazení statistik, <strong>delete_users</strong> ("administrátor") pro mazání statistik a <strong>manage_options</strong> ("administrátor") pro změnu nastavení.

source: Capability required for viewing download stats:
cs_cz: Schopnost (capability) pro zobrazení statistik:

source: Capability required for reseting download stats:
cs_cz: Schopnost (capability) pro smazání statistik:

source: Capability required for setting SDMON options:
cs_cz: Schopnost (capability) pro nastavení:

source: Allowed directories
cs_cz: Povolené adresáře

source: Only requested files whose full names (relative to document root) start with this regular expression will be processed. It is strongly recommended to place all downloadable files (and ONLY downloadable files) into a designated directory and then placing that directory's name followed by a slash here. It is possible to use the power of PREG to allow multiple directories, but make sure there are ONLY files which you are comfortable with malicious users downloading. Do not EVER allow directories which contain PHP files here! That could lead to disclosure of sensitive data, including username and password used to connect to WordPress database.
cs_cz: Zpracovávány budou pouze soubory, jejichž plná jména (relativní vůči kořenovému adresáři webu) začínají tímto regulárním výrazem. Silně doporučuji umístit všechny stažitelné soubory (a JENOM stažitelné soubory) do jednoho určeného adresáře a vepsat sem název tohoto adresáře zakončený lomítkem. Lze také využít všech možností, které dává PREG, pro povolení více adresářů, ale dejte si pozor, ať v nich jsou JEDINĚ soubory, u kterých vám nevadí, když si je stáhne útočník. NIKDY do těchto adresářů neukládejte žádné PHP soubory! To by mohlo vést k zveřejnění citlivých dat, včetně uživatelského jména a hesla pro připojení k databázi.

source: Default value is <code>files/</code>, which only allows download from /files directory (the leading <code>/</code> is implicit).
cs_cz: Výchozí hodnota je <code>files/</code>, která dovolí stahovat pouze soubory z adresáře /files (úvodní <code>/</code> je dosazeno automaticky).

source: Allowed extensions
cs_cz: Povolené přípony

source: Only files with extensions matching this regular expressions will be processed. This is another important security value. Make sure you only add extensions which are safe for malicious users to have, e.g. archives and possibly images. Do NOT use any expression that could allow a user to download PHP files, even if you think it safe given the Allowed Directories option above.
cs_cz: Zpracovávány budou pouze soubory, jejichž přípony odpovídají tomuto regulárnímu výrazu. Jde o další důležitý bezpečnostní prvek. Dejte si pozor, ať jsou zde uvedeny pouze takové přípony, které nemohou být zneužity útočníky, tzn. komprimované archívy a případně obrázky. NEPOUŽÍVEJTE výrazy, které by mohly uživateli dovolit download PHP souborů, ani kdyby tyto soubory vylučovalo nastavení "Povolené adresáře" výše.

source: Default value is <code>zip|rar|7z</code> which only allows download of files ending with <code>.zip</code>, <code>.rar</code> and <code>.7z</code> (the leading <code>.</code> is implicit).
cs_cz: Výchozí hodnota je <code>zip|rar|7z</code>, která povolí pouze stahování souborů s příponou <code>.zip</code>, <code>.rar</code> a <code>.7z</code> (úvodní <code>.</code> je dosazena automaticky).

source: Inline files
cs_cz: Soubory pro inline zobrazení

source: Files whose names match this regular expression will be displayed inline (within a HTML page) rather than downloaded.
cs_cz: Soubory, které vyhovují tomuto regulárnímu výrazu, budou zobrazeny inline (jako objekt - např. obrázek nebo video - uvnitř HTML stránky) místo aby se stahovaly.

source: By default, this value is empty - no files will appear inline, all will be downloaded. You may want to place something like <code>\.(jpe?g|gif|png|swf)$</code> here to make images and Flash videos appear inline.
cs_cz: Výchozí hodnotou je prázdný řetězec - všechny soubory se budou stahovat, žádný nebude zobrazen inline. Vepište sem něco jako <code>\.(jpe?g|gif|png|swf)$</code> pro zobrazování obrázků a Flashů inline.

source: Note: Unlike the options above, nothing is implied in this regular expression. You <em>must</em> use an explicit <code>\.</code> to denote "start of extension", you <em>must</em> use an explicit <code>$</code> to mark "end of filename", etc.
cs_cz: Pozn.: Narozdíl od nastavení uvedených výše se do tohoto regulárního výrazu nic nedoplňuje. Pokud chcete vyznačit "začátek přípony", <em>musíte</em> sem napsat <code>\.</code>; pokud chcete vyznačit "konec názvu souboru", <em>musíte</em> sem napsat <code>$</code>, a podobně.

source: Also note that this plugin uses PCRE-compatible regular expressions, NOT the better-known POSIX-compatible regular expressions. As a result, a valid regular expression must be at least three characters long - separator twice, and at least one character for a meaningful r.e.
cs_cz: Dále upozorňuji, že plugin používá PCRE-kompatibilní regulární výrazy a ne známější POSIX-kompatibilní. Z tohoto důvodu je vyžadováno, aby regulární výraz byl aspoň tři znaky dlouhý - dva znaky na dva výskyty oddělovače a aspoň jeden znak pro smysluplný r.e.

source: Store detailed logs?
cs_cz: Ukládat detailní záznamy?

source: If detailed logs are allowed, various information (including exact time of download, user's IP address, referrer etc.) is stored. This can fill your database quickly if you have only a little space or a lot of popular downloads. Otherwise just the total numbers of downloads are stored, consuming significantly less space.
cs_cz: Pokud je tato volba zapnuta, ukládají se detailní informace (jako přesný čas, IP adresa uživatele nebo referer) o každém downloadu. To může rychle zahltit databázi, pokud máte jen málo prostoru nebo populární downloady. Normálně se ukládá jen celkový počet stažení, který zabírá podstatně méně místa.

source: Use detailed statistics.
cs_cz: Používat detailní statistiky

source: Ignored users
cs_cz: Ignorovaní uživatelé

source: List of users whose downloads are not monitored. Separate multiple users with pipe character <code>|</code>. It is useful to prevent administrator damaging the statistics by testing that downloads work.
cs_cz: Seznam uživatelů, jejichž downloady nejsou sledovány. Uživatelská jména oddělujte znakem roury <code>|</code>. Funkce se hodí pro administrátory, kteří chtějí ověřovat funkčnost odkazů, ale nepřejí si, aby se jejich testy zaznamenávaly do statistik.

source: Ignore quick re-downloads
cs_cz: Ignorovat rychlé opakované downloady

source: If one IP address requests the same download several times within a given time interval, only the first time will be recorded. If a zero or a negative value is entered, all downloads will get recorded regardless of how quickly they occur after each other.
cs_cz: Pokud se jedna IP adresa pokusí stáhnout jeden soubor několikrát po sobě v daném časovém intervalu, zaznamená se do statistik jen první pokus. Pokud je rozpětí stanoveno na nula nebo záporné číslo, budou se zaznamenávat všechny downloady, bez ohledu na to, jak rychle po sobě následují.

source: seconds
cs_cz: sekund

source: Limit number of downloads per IP address
cs_cz: Omezit počet downloadů z jedné IP adresy

source: Limit the number of files an IP address can download per day. The default value of zero means 'no limits' - an IP address can download as many files as it likes. Note that various download managers can initiate several downloads for each file, so make sure the limit is high enough not to interfere with the normal usage of your site. Also, please understand that this is NOT a perfect solution: One IP address can be shared by multiple users, and one user can easily use more than one IP address.
cs_cz: Omezit počet souborů, které může jedna IP adresa stáhnout za jeden den. Výchozí hodnota nula značí "bez omezení" - IP adresa může stáhnout libovolné množství souborů. Pozor, různé download managery mohou spustit pro jeden soubor několik stahování najednou; ujistěte se, že je limit dost velký na to, aby bránil v běžném používání vašich stránek. Také si prosím uvědomte, že toto NENÍ dokonalé řešení: Jednu IP adresu může sdílet mnoho uživatelů, a naopak jeden uživatel může mít mnoho IP adres.

source: Users listed in the <strong>Ignored users</strong> section above can always download an unlimited number of files.
cs_cz: Uživatelé uvedení v sekci <strong>Ignorovaní uživatelé</strong> výše mohou stahovat neomezený počet souborů.

source: Visitors:
cs_cz: Návštěvníci:

source: Registered users:
cs_cz: Registrovaní uživatelé

source: Error message:
cs_cz: Chybová zpráva:

source: (The first <code>%d</code> will be replaced by number of hours, the second one by number of minutes.)
cs_cz: (První <code>%d</code> bude nahrazeno počtem hodin, druhé počtem minut.)

source: Use more detailed error messages
cs_cz: Detailní chybové zprávy

source: In case a link doesn't pass the security checks, display a more detailed error message than just "file not found". This is useful for the initial setting up, but can be used to exploit the security of your site (e.g. discovering whether a file exists). I recommend unchecking this option as soon as you get SDMon working.
cs_cz: Pokud odkaz neprojde bezpečnostními kontrolami, zobrazí se detailnější chybová zpráva než jen "soubor nenalezen". To se může hodit v průběhu prvotního nastavování pluginu, ale může být zneužito útočníkem k získání citlivých informací (např. jestli soubor existuje nebo neexistuje). Doporučuji tuto volbu odškrtnout hned poté, co se vám podaří SDMon úspěšně rozběhnout.

source: Use more detailed error messages.
cs_cz: Používat detailní chybové zprávy.

source: Use an intermediate Download page
cs_cz: Zobrazovat uživateli stránku informující o downloadu

source: Before sending the actual requested file, display an intermediate download page which tells the user that the download is about to start.
cs_cz: Před odesláním vyžádaného souboru bude zobrazena stránka, která uživatele informuje o tom, že jeho download co nevidět začne.

source: Use the intermediate download page.
cs_cz: Zobrazovat informační stránku.

source: Path to your download page:
cs_cz: Cesta k informační stránce:

source: You can use <strong>%s</strong> to use a demo page provided with the plugin.
cs_cz: Můžete zde vyplnit <strong>%s</strong> - tím použijete demonstrační stránku dodávanou s pluginem.

source: This functionality was suggested and for the most part programmed by <a href="http://matbra.com">Matheus Bratfisch</a>, I (Pepak) just cleaned it up and added it to the plugin's distribution.
cs_cz: Tuto funkci navrhl a z větší části naprogramoval <a href="http://matbra.com">Matheus Bratfisch</a>, já (Pepak) jsem ji pouze učesal a přidal do distribučního archívu pluginu.

source: Basepath modifier
cs_cz: Modifikátor k základní cestě

source: Note: Keep this option empty unless you know what you are doing. DO NOT ASK! The use of this option is not supported.
cs_cz: Pozn.: Nechte toto nastavení prázdné, pokud nevíte, co děláte. NEPTEJTE SE MĚ! Toto nastavení není podporované.

source: You can provide a modifier which, applied to WordPress' ABSPATH, gets you to the base directory from which relative links to files start. This way you can store files outside of the WordPress directory tree, by using something like <code>../private_dir/</code> (the ending slash is required). Note that this option is incompatible with some functionality and is not supported - if you want to use it, search the plugin's source code for <code>basepath_modifier</code>, understand how it is used and then act accordingly.
cs_cz: Zde můžete uvést modifikátor, který, připojený za ABSPATH, vás dostane do výchozího adresáře, ke kterému se vztahují relativní cesty ke stahovaným souborům. Takto můžete ukládat soubory mimo adresářový strom WordPressu - použijte něco jako <code>../private_dir/</code> (závěrečné lomítko je povinné). Upozorňuji, že toto nastavení není kompatibilní s některými jinými a není podporované - pokud ho chcete použít, najděte si ve zdrojovém kódu pluginu všechny výskyty <code>basepath_modifier</code>, porozumějte jim a teprve pak něco nastavujte.

source: Update settings
cs_cz: Uložit nastavení

source: First
cs_cz: První

source: Previous
cs_cz: Předchozí

source: Next
cs_cz: Další

source: Last
cs_cz: Poslední

source: Nonexistent downloads
cs_cz: Neexistující soubory

source: All downloads
cs_cz: Všechny downloady

source: Show all downloads
cs_cz: Zobrazit všechny soubory

source: Show nonexistent downloads
cs_cz: Zobrazit neexistující soubory

source: Filename
cs_cz: Název souboru

source: Download count
cs_cz: Počet stažení

source: Last date
cs_cz: Poslední datum

source: Hide from sidebar
cs_cz: Skrýt z postranního panelu

source: Reset to zero
cs_cz: Vynulovat

source: Hidden
cs_cz: Skrytý

source: Reset
cs_cz: Vynulovat

source: Reset checked statistics
cs_cz: Vymazat označené statistiky

source: Reset all statistics
cs_cz: Vymazat všechny statistiky

source: Yes, I am sure
cs_cz: Ano, chci to udělat

source: Detailed data for <strong>%s</strong>:
cs_cz: Detailní data pro <strong>%s</strong>:

source: Total number of downloads: <strong>%d</strong>.
cs_cz: Celkový počet stažení: <strong>%d</strong>.

source: Date
cs_cz: Datum

source: Country
cs_cz: Země

source: IP address
cs_cz: IP adresa

source: Username
cs_cz: Uživatel

source: Delete this statistic
cs_cz: Vymazat tuto statistiku

source: Delete checked statistics
cs_cz: Vymazat označené statistiky

source: Delete all statistics
cs_cz: Vymazat všechny statistiky

source: Return to full list.
cs_cz: Návrat do úplného seznamu

source: Allows you to display the most popular downloads in the sidebar.
cs_cz: Dovoluje zobrazit v postranním panelu seznam nejoblíbenějších souborů.

source: Popular files
cs_cz: Oblíbené soubory

source: Title:
cs_cz: Zobrazovaný název:

source: Number of files to show:
cs_cz: Počet zobrazených souborů:

source: Only show filenames which match this LIKE condition:
cs_cz: Zobrazovat pouze soubory, které vyhovují této LIKE podmínce:

source: Empty string matches all filenames and is useful for most usage scenarios. You would only use a non-empty value if you wanted to create multiple SDMon widgets, each showing a different list of files: only filenames which match the given string in a LIKE condition of a SQL query will be shown. The most common values would be something like <code>files/documents/%</code> (meaning "The filename must begin with <code>files/documents/</code>") or <code>%.mp3</code> (meaning "The filename must end with <code>.mp3</code>") - the percentage symbol <code>%</code> means "anything", the underscore symbol <code>_</code> means "Any one character".
cs_cz: Prázdný řetězec neomezuje seznam souborů a je vhodný pro nejběžnější typy použití. Neprázdnou hodnotu použijte, pokud chcete zobrazit několik nezávislých widgetů, kde každý bude zobrazovat jiný seznam souborů - pak budou zobrazeny jen ty soubory, jejichž názvy vyhoví podmínce. Typické hodnoty vypadají jako <code>files/dokumenty/%</code> ("Jméno souboru musí začínat <code>files/dokumenty/</code>") nebo <code>%.mp3</code> ("Jméno souboru musí končit <code>.mp3</code>") - symbol procenta <code>%</code> značí "cokoliv", symbol podtržítka <code>_</code> značí "právě jeden libovolný znak".
